#Timur Turebekov

#Урок №1, задание №1

# Напишите программу, которая спрашивает имя пользователя и затем приветствует его.

# name = input('Введите имя: ')
# print('Привет, ' + name)

#Урок №1, задание №2

#Напишите программу, которая считывает три числа и выводит их сумму.

# 2.1 - Числа указаны в функции print
# 2.2 - Числа указаны в переменных
# 2.3 -Числа вводит человек

# number1 = int(input('Введите первое число: '))
# number2 = int(input('Введите второе число: '))
# number3 = int(input('Введите третье число: '))
#
# print('Сумма чисел ', number1, number2, 'и', number3, 'равно' , number1 + number2 + number3)

#Урок №1, задание №3

#Напишите программу, для решения следующей задачи: n школьников делят k яблок поровну, неделящийся остаток остается в корзинке.
#Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке?
#Программа получает на вход числа n и k и должна вывести искомое количество яблок (два числа).

# n = int(input('Количество школьников = '))
# k = int(input('Количество яблок = '))
# print ('достанется по', n // k, 'останется в корзине =', n % k)

#Урок №1, задание №4

#Напишите программу, которая спрашивает число у пользователя и выводит следующее:

# number1 = int(input('Введите число: '))
# number2 = int(1)
# print('Следующее число для', number1, '--> ', number1 + number2)
# print('Предыдущее число для', number1, '--> ', number1 - number2)

#Урок №1, задание №5

#Напишите программу, которая выводит текст в данном формате:

# print('Twinkle, twinkle, little star,\n\tHow I wonder what you are!')
# print('\t\tUp above the world so high\n\t\tLike a diamond in the sky')
# print('Twinkle, twinkle, little star,\n\t\t How I wonder what you are')

#Урок №1, задание №6

#Напишите программу для использования метода форматирования следующих
#трех переменных в соответствии с ожидаемым результатом.

# total_money = 1000
# quantity = 3
# price = 450
#
# print(f'У меня есть {total_money} долларов, поэтому я могу купить {quantity} футбольных мяча за {price} долларов')

#Урок №1, задание №7

#Создайте две переменных, со значением ‘spam’ и ‘eggs’, затем распечатайте объединив две переменной в одну целую

# a = 'spam'
# b = 'eggs'
#
# c = (a + b)
# print(c)

print('123')


